feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC37A/_Reg/IfxDma_reg.h
/** \brief 1CF0, DMA Channel 60 Suspend Acknowledge Register */
#define DMA_SUSACR60 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CF0u)
/** Alias (User Manual Name) for DMA_SUSACR60.
* To use register names with standard convension, please use DMA_SUSACR60.
*/
#define DMA_SUSACR060 (DMA_SUSACR60)

/** \brief 1CF4, DMA Channel 61 Suspend Acknowledge Register */
#define DMA_SUSACR61 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CF4u)
/** Alias (User Manual Name) for DMA_SUSACR61.
* To use register names with standard convension, please use DMA_SUSACR61.
*/
#define DMA_SUSACR061 (DMA_SUSACR61)

/** \brief 1CF8, DMA Channel 62 Suspend Acknowledge Register */
#define DMA_SUSACR62 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CF8u)
/** Alias (User Manual Name) for DMA_SUSACR62.
* To use register names with standard convension, please use DMA_SUSACR62.
*/
#define DMA_SUSACR062 (DMA_SUSACR62)

/** \brief 1CFC, DMA Channel 63 Suspend Acknowledge Register */
#define DMA_SUSACR63 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CFCu)
/** Alias (User Manual Name) for DMA_SUSACR63.
* To use register names with standard convension, please use DMA_SUSACR63.
*/
#define DMA_SUSACR063 (DMA_SUSACR63)

/** \brief 1D00, DMA Channel 64 Suspend Acknowledge Register */
#define DMA_SUSACR64 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D00u)
/** Alias (User Manual Name) for DMA_SUSACR64.
* To use register names with standard convension, please use DMA_SUSACR64.
*/
#define DMA_SUSACR064 (DMA_SUSACR64)

/** \brief 1D04, DMA Channel 65 Suspend Acknowledge Register */
#define DMA_SUSACR65 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D04u)
/** Alias (User Manual Name) for DMA_SUSACR65.
* To use register names with standard convension, please use DMA_SUSACR65.
*/
#define DMA_SUSACR065 (DMA_SUSACR65)

/** \brief 1D08, DMA Channel 66 Suspend Acknowledge Register */
#define DMA_SUSACR66 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D08u)
/** Alias (User Manual Name) for DMA_SUSACR66.
* To use register names with standard convension, please use DMA_SUSACR66.
*/
#define DMA_SUSACR066 (DMA_SUSACR66)

/** \brief 1D0C, DMA Channel 67 Suspend Acknowledge Register */
#define DMA_SUSACR67 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D0Cu)
/** Alias (User Manual Name) for DMA_SUSACR67.
* To use register names with standard convension, please use DMA_SUSACR67.
*/
#define DMA_SUSACR067 (DMA_SUSACR67)

/** \brief 1D10, DMA Channel 68 Suspend Acknowledge Register */
#define DMA_SUSACR68 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D10u)
/** Alias (User Manual Name) for DMA_SUSACR68.
* To use register names with standard convension, please use DMA_SUSACR68.
*/
#define DMA_SUSACR068 (DMA_SUSACR68)

/** \brief 1D14, DMA Channel 69 Suspend Acknowledge Register */
#define DMA_SUSACR69 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D14u)
/** Alias (User Manual Name) for DMA_SUSACR69.
* To use register names with standard convension, please use DMA_SUSACR69.
*/
#define DMA_SUSACR069 (DMA_SUSACR69)

/** \brief 1D18, DMA Channel 70 Suspend Acknowledge Register */
#define DMA_SUSACR70 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D18u)
/** Alias (User Manual Name) for DMA_SUSACR70.
* To use register names with standard convension, please use DMA_SUSACR70.
*/
#define DMA_SUSACR070 (DMA_SUSACR70)

/** \brief 1D1C, DMA Channel 71 Suspend Acknowledge Register */
#define DMA_SUSACR71 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D1Cu)
/** Alias (User Manual Name) for DMA_SUSACR71.
* To use register names with standard convension, please use DMA_SUSACR71.
*/
#define DMA_SUSACR071 (DMA_SUSACR71)

/** \brief 1D20, DMA Channel 72 Suspend Acknowledge Register */
#define DMA_SUSACR72 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D20u)
/** Alias (User Manual Name) for DMA_SUSACR72.
* To use register names with standard convension, please use DMA_SUSACR72.
*/
#define DMA_SUSACR072 (DMA_SUSACR72)

/** \brief 1D24, DMA Channel 73 Suspend Acknowledge Register */
#define DMA_SUSACR73 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D24u)
/** Alias (User Manual Name) for DMA_SUSACR73.
* To use register names with standard convension, please use DMA_SUSACR73.
*/
#define DMA_SUSACR073 (DMA_SUSACR73)

/** \brief 1D28, DMA Channel 74 Suspend Acknowledge Register */
#define DMA_SUSACR74 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D28u)
/** Alias (User Manual Name) for DMA_SUSACR74.
* To use register names with standard convension, please use DMA_SUSACR74.
*/
#define DMA_SUSACR074 (DMA_SUSACR74)

/** \brief 1D2C, DMA Channel 75 Suspend Acknowledge Register */
#define DMA_SUSACR75 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D2Cu)
/** Alias (User Manual Name) for DMA_SUSACR75.
* To use register names with standard convension, please use DMA_SUSACR75.
*/
#define DMA_SUSACR075 (DMA_SUSACR75)

/** \brief 1D30, DMA Channel 76 Suspend Acknowledge Register */
#define DMA_SUSACR76 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D30u)
/** Alias (User Manual Name) for DMA_SUSACR76.
* To use register names with standard convension, please use DMA_SUSACR76.
*/
#define DMA_SUSACR076 (DMA_SUSACR76)

/** \brief 1D34, DMA Channel 77 Suspend Acknowledge Register */
#define DMA_SUSACR77 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D34u)
/** Alias (User Manual Name) for DMA_SUSACR77.
* To use register names with standard convension, please use DMA_SUSACR77.
*/
#define DMA_SUSACR077 (DMA_SUSACR77)

/** \brief 1D38, DMA Channel 78 Suspend Acknowledge Register */
#define DMA_SUSACR78 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D38u)
/** Alias (User Manual Name) for DMA_SUSACR78.
* To use register names with standard convension, please use DMA_SUSACR78.
*/
#define DMA_SUSACR078 (DMA_SUSACR78)

/** \brief 1D3C, DMA Channel 79 Suspend Acknowledge Register */
#define DMA_SUSACR79 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D3Cu)
/** Alias (User Manual Name) for DMA_SUSACR79.
* To use register names with standard convension, please use DMA_SUSACR79.
*/
#define DMA_SUSACR079 (DMA_SUSACR79)

/** \brief 1D40, DMA Channel 80 Suspend Acknowledge Register */
#define DMA_SUSACR80 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D40u)
/** Alias (User Manual Name) for DMA_SUSACR80.
* To use register names with standard convension, please use DMA_SUSACR80.
*/
#define DMA_SUSACR080 (DMA_SUSACR80)

/** \brief 1D44, DMA Channel 81 Suspend Acknowledge Register */
#define DMA_SUSACR81 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D44u)
/** Alias (User Manual Name) for DMA_SUSACR81.
* To use register names with standard convension, please use DMA_SUSACR81.
*/
#define DMA_SUSACR081 (DMA_SUSACR81)

/** \brief 1D48, DMA Channel 82 Suspend Acknowledge Register */
#define DMA_SUSACR82 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D48u)
/** Alias (User Manual Name) for DMA_SUSACR82.
* To use register names with standard convension, please use DMA_SUSACR82.
*/
#define DMA_SUSACR082 (DMA_SUSACR82)

/** \brief 1D4C, DMA Channel 83 Suspend Acknowledge Register */
#define DMA_SUSACR83 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D4Cu)
/** Alias (User Manual Name) for DMA_SUSACR83.
* To use register names with standard convension, please use DMA_SUSACR83.
*/
#define DMA_SUSACR083 (DMA_SUSACR83)

/** \brief 1D50, DMA Channel 84 Suspend Acknowledge Register */
#define DMA_SUSACR84 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D50u)
/** Alias (User Manual Name) for DMA_SUSACR84.
* To use register names with standard convension, please use DMA_SUSACR84.
*/
#define DMA_SUSACR084 (DMA_SUSACR84)

/** \brief 1D54, DMA Channel 85 Suspend Acknowledge Register */
#define DMA_SUSACR85 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D54u)
/** Alias (User Manual Name) for DMA_SUSACR85.
* To use register names with standard convension, please use DMA_SUSACR85.
*/
#define DMA_SUSACR085 (DMA_SUSACR85)

/** \brief 1D58, DMA Channel 86 Suspend Acknowledge Register */
#define DMA_SUSACR86 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D58u)
/** Alias (User Manual Name) for DMA_SUSACR86.
* To use register names with standard convension, please use DMA_SUSACR86.
*/
#define DMA_SUSACR086 (DMA_SUSACR86)

/** \brief 1D5C, DMA Channel 87 Suspend Acknowledge Register */
#define DMA_SUSACR87 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D5Cu)
/** Alias (User Manual Name) for DMA_SUSACR87.
* To use register names with standard convension, please use DMA_SUSACR87.
*/
#define DMA_SUSACR087 (DMA_SUSACR87)

/** \brief 1D60, DMA Channel 88 Suspend Acknowledge Register */
#define DMA_SUSACR88 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D60u)
/** Alias (User Manual Name) for DMA_SUSACR88.
* To use register names with standard convension, please use DMA_SUSACR88.
*/
#define DMA_SUSACR088 (DMA_SUSACR88)

/** \brief 1D64, DMA Channel 89 Suspend Acknowledge Register */
#define DMA_SUSACR89 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D64u)
/** Alias (User Manual Name) for DMA_SUSACR89.
* To use register names with standard convension, please use DMA_SUSACR89.
*/
#define DMA_SUSACR089 (DMA_SUSACR89)

