feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC37A/_Reg/IfxDma_reg.h
/** \brief 2814, DMARAM Channel 64 Configuration Register */
#define DMA_CH64_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012814u)
/** Alias (User Manual Name) for DMA_CH64_CHCFGR.
* To use register names with standard convension, please use DMA_CH64_CHCFGR.
*/
#define DMA_CHCFGR064 (DMA_CH64_CHCFGR)

/** \brief 2818, DMARAM Channel 64 Shadow Address Register */
#define DMA_CH64_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012818u)
/** Alias (User Manual Name) for DMA_CH64_SHADR.
* To use register names with standard convension, please use DMA_CH64_SHADR.
*/
#define DMA_SHADR064 (DMA_CH64_SHADR)

/** \brief 281C, DMARAM Channel 64 Control and Status Register */
#define DMA_CH64_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001281Cu)
/** Alias (User Manual Name) for DMA_CH64_CHCSR.
* To use register names with standard convension, please use DMA_CH64_CHCSR.
*/
#define DMA_CHCSR064 (DMA_CH64_CHCSR)

/** \brief 2820, DMARAM Channel 65 Read Data CRC Register */
#define DMA_CH65_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012820u)
/** Alias (User Manual Name) for DMA_CH65_RDCRCR.
* To use register names with standard convension, please use DMA_CH65_RDCRCR.
*/
#define DMA_RDCRCR065 (DMA_CH65_RDCRCR)

/** \brief 2824, DMARAM Channel 65 Source and Destination Address CRC Register */
#define DMA_CH65_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012824u)
/** Alias (User Manual Name) for DMA_CH65_SDCRCR.
* To use register names with standard convension, please use DMA_CH65_SDCRCR.
*/
#define DMA_SDCRCR065 (DMA_CH65_SDCRCR)

/** \brief 2828, DMARAM Channel 65 Source Address Register */
#define DMA_CH65_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012828u)
/** Alias (User Manual Name) for DMA_CH65_SADR.
* To use register names with standard convension, please use DMA_CH65_SADR.
*/
#define DMA_SADR065 (DMA_CH65_SADR)

/** \brief 282C, DMARAM Channel 65 Destination Address Register */
#define DMA_CH65_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001282Cu)
/** Alias (User Manual Name) for DMA_CH65_DADR.
* To use register names with standard convension, please use DMA_CH65_DADR.
*/
#define DMA_DADR065 (DMA_CH65_DADR)

/** \brief 2830, DMARAM Channel 65 Address and Interrupt Control Register */
#define DMA_CH65_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012830u)
/** Alias (User Manual Name) for DMA_CH65_ADICR.
* To use register names with standard convension, please use DMA_CH65_ADICR.
*/
#define DMA_ADICR065 (DMA_CH65_ADICR)

/** \brief 2834, DMARAM Channel 65 Configuration Register */
#define DMA_CH65_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012834u)
/** Alias (User Manual Name) for DMA_CH65_CHCFGR.
* To use register names with standard convension, please use DMA_CH65_CHCFGR.
*/
#define DMA_CHCFGR065 (DMA_CH65_CHCFGR)

/** \brief 2838, DMARAM Channel 65 Shadow Address Register */
#define DMA_CH65_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012838u)
/** Alias (User Manual Name) for DMA_CH65_SHADR.
* To use register names with standard convension, please use DMA_CH65_SHADR.
*/
#define DMA_SHADR065 (DMA_CH65_SHADR)

/** \brief 283C, DMARAM Channel 65 Control and Status Register */
#define DMA_CH65_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001283Cu)
/** Alias (User Manual Name) for DMA_CH65_CHCSR.
* To use register names with standard convension, please use DMA_CH65_CHCSR.
*/
#define DMA_CHCSR065 (DMA_CH65_CHCSR)

/** \brief 2840, DMARAM Channel 66 Read Data CRC Register */
#define DMA_CH66_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012840u)
/** Alias (User Manual Name) for DMA_CH66_RDCRCR.
* To use register names with standard convension, please use DMA_CH66_RDCRCR.
*/
#define DMA_RDCRCR066 (DMA_CH66_RDCRCR)

/** \brief 2844, DMARAM Channel 66 Source and Destination Address CRC Register */
#define DMA_CH66_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012844u)
/** Alias (User Manual Name) for DMA_CH66_SDCRCR.
* To use register names with standard convension, please use DMA_CH66_SDCRCR.
*/
#define DMA_SDCRCR066 (DMA_CH66_SDCRCR)

/** \brief 2848, DMARAM Channel 66 Source Address Register */
#define DMA_CH66_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012848u)
/** Alias (User Manual Name) for DMA_CH66_SADR.
* To use register names with standard convension, please use DMA_CH66_SADR.
*/
#define DMA_SADR066 (DMA_CH66_SADR)

/** \brief 284C, DMARAM Channel 66 Destination Address Register */
#define DMA_CH66_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001284Cu)
/** Alias (User Manual Name) for DMA_CH66_DADR.
* To use register names with standard convension, please use DMA_CH66_DADR.
*/
#define DMA_DADR066 (DMA_CH66_DADR)

/** \brief 2850, DMARAM Channel 66 Address and Interrupt Control Register */
#define DMA_CH66_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012850u)
/** Alias (User Manual Name) for DMA_CH66_ADICR.
* To use register names with standard convension, please use DMA_CH66_ADICR.
*/
#define DMA_ADICR066 (DMA_CH66_ADICR)

/** \brief 2854, DMARAM Channel 66 Configuration Register */
#define DMA_CH66_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012854u)
/** Alias (User Manual Name) for DMA_CH66_CHCFGR.
* To use register names with standard convension, please use DMA_CH66_CHCFGR.
*/
#define DMA_CHCFGR066 (DMA_CH66_CHCFGR)

/** \brief 2858, DMARAM Channel 66 Shadow Address Register */
#define DMA_CH66_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012858u)
/** Alias (User Manual Name) for DMA_CH66_SHADR.
* To use register names with standard convension, please use DMA_CH66_SHADR.
*/
#define DMA_SHADR066 (DMA_CH66_SHADR)

/** \brief 285C, DMARAM Channel 66 Control and Status Register */
#define DMA_CH66_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001285Cu)
/** Alias (User Manual Name) for DMA_CH66_CHCSR.
* To use register names with standard convension, please use DMA_CH66_CHCSR.
*/
#define DMA_CHCSR066 (DMA_CH66_CHCSR)

/** \brief 2860, DMARAM Channel 67 Read Data CRC Register */
#define DMA_CH67_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012860u)
/** Alias (User Manual Name) for DMA_CH67_RDCRCR.
* To use register names with standard convension, please use DMA_CH67_RDCRCR.
*/
#define DMA_RDCRCR067 (DMA_CH67_RDCRCR)

/** \brief 2864, DMARAM Channel 67 Source and Destination Address CRC Register */
#define DMA_CH67_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012864u)
/** Alias (User Manual Name) for DMA_CH67_SDCRCR.
* To use register names with standard convension, please use DMA_CH67_SDCRCR.
*/
#define DMA_SDCRCR067 (DMA_CH67_SDCRCR)

/** \brief 2868, DMARAM Channel 67 Source Address Register */
#define DMA_CH67_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012868u)
/** Alias (User Manual Name) for DMA_CH67_SADR.
* To use register names with standard convension, please use DMA_CH67_SADR.
*/
#define DMA_SADR067 (DMA_CH67_SADR)

/** \brief 286C, DMARAM Channel 67 Destination Address Register */
#define DMA_CH67_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001286Cu)
/** Alias (User Manual Name) for DMA_CH67_DADR.
* To use register names with standard convension, please use DMA_CH67_DADR.
*/
#define DMA_DADR067 (DMA_CH67_DADR)

/** \brief 2870, DMARAM Channel 67 Address and Interrupt Control Register */
#define DMA_CH67_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012870u)
/** Alias (User Manual Name) for DMA_CH67_ADICR.
* To use register names with standard convension, please use DMA_CH67_ADICR.
*/
#define DMA_ADICR067 (DMA_CH67_ADICR)

