feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC37A/_Reg/IfxDma_reg.h
/** \brief 2B8C, DMARAM Channel 92 Destination Address Register */
#define DMA_CH92_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012B8Cu)
/** Alias (User Manual Name) for DMA_CH92_DADR.
* To use register names with standard convension, please use DMA_CH92_DADR.
*/
#define DMA_DADR092 (DMA_CH92_DADR)

/** \brief 2B90, DMARAM Channel 92 Address and Interrupt Control Register */
#define DMA_CH92_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012B90u)
/** Alias (User Manual Name) for DMA_CH92_ADICR.
* To use register names with standard convension, please use DMA_CH92_ADICR.
*/
#define DMA_ADICR092 (DMA_CH92_ADICR)

/** \brief 2B94, DMARAM Channel 92 Configuration Register */
#define DMA_CH92_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012B94u)
/** Alias (User Manual Name) for DMA_CH92_CHCFGR.
* To use register names with standard convension, please use DMA_CH92_CHCFGR.
*/
#define DMA_CHCFGR092 (DMA_CH92_CHCFGR)

/** \brief 2B98, DMARAM Channel 92 Shadow Address Register */
#define DMA_CH92_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012B98u)
/** Alias (User Manual Name) for DMA_CH92_SHADR.
* To use register names with standard convension, please use DMA_CH92_SHADR.
*/
#define DMA_SHADR092 (DMA_CH92_SHADR)

/** \brief 2B9C, DMARAM Channel 92 Control and Status Register */
#define DMA_CH92_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012B9Cu)
/** Alias (User Manual Name) for DMA_CH92_CHCSR.
* To use register names with standard convension, please use DMA_CH92_CHCSR.
*/
#define DMA_CHCSR092 (DMA_CH92_CHCSR)

/** \brief 2BA0, DMARAM Channel 93 Read Data CRC Register */
#define DMA_CH93_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012BA0u)
/** Alias (User Manual Name) for DMA_CH93_RDCRCR.
* To use register names with standard convension, please use DMA_CH93_RDCRCR.
*/
#define DMA_RDCRCR093 (DMA_CH93_RDCRCR)

/** \brief 2BA4, DMARAM Channel 93 Source and Destination Address CRC Register */
#define DMA_CH93_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012BA4u)
/** Alias (User Manual Name) for DMA_CH93_SDCRCR.
* To use register names with standard convension, please use DMA_CH93_SDCRCR.
*/
#define DMA_SDCRCR093 (DMA_CH93_SDCRCR)

/** \brief 2BA8, DMARAM Channel 93 Source Address Register */
#define DMA_CH93_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012BA8u)
/** Alias (User Manual Name) for DMA_CH93_SADR.
* To use register names with standard convension, please use DMA_CH93_SADR.
*/
#define DMA_SADR093 (DMA_CH93_SADR)

/** \brief 2BAC, DMARAM Channel 93 Destination Address Register */
#define DMA_CH93_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012BACu)
/** Alias (User Manual Name) for DMA_CH93_DADR.
* To use register names with standard convension, please use DMA_CH93_DADR.
*/
#define DMA_DADR093 (DMA_CH93_DADR)

/** \brief 2BB0, DMARAM Channel 93 Address and Interrupt Control Register */
#define DMA_CH93_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012BB0u)
/** Alias (User Manual Name) for DMA_CH93_ADICR.
* To use register names with standard convension, please use DMA_CH93_ADICR.
*/
#define DMA_ADICR093 (DMA_CH93_ADICR)

/** \brief 2BB4, DMARAM Channel 93 Configuration Register */
#define DMA_CH93_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012BB4u)
/** Alias (User Manual Name) for DMA_CH93_CHCFGR.
* To use register names with standard convension, please use DMA_CH93_CHCFGR.
*/
#define DMA_CHCFGR093 (DMA_CH93_CHCFGR)

/** \brief 2BB8, DMARAM Channel 93 Shadow Address Register */
#define DMA_CH93_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012BB8u)
/** Alias (User Manual Name) for DMA_CH93_SHADR.
* To use register names with standard convension, please use DMA_CH93_SHADR.
*/
#define DMA_SHADR093 (DMA_CH93_SHADR)

/** \brief 2BBC, DMARAM Channel 93 Control and Status Register */
#define DMA_CH93_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012BBCu)
/** Alias (User Manual Name) for DMA_CH93_CHCSR.
* To use register names with standard convension, please use DMA_CH93_CHCSR.
*/
#define DMA_CHCSR093 (DMA_CH93_CHCSR)

/** \brief 2BC0, DMARAM Channel 94 Read Data CRC Register */
#define DMA_CH94_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012BC0u)
/** Alias (User Manual Name) for DMA_CH94_RDCRCR.
* To use register names with standard convension, please use DMA_CH94_RDCRCR.
*/
#define DMA_RDCRCR094 (DMA_CH94_RDCRCR)

/** \brief 2BC4, DMARAM Channel 94 Source and Destination Address CRC Register */
#define DMA_CH94_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012BC4u)
/** Alias (User Manual Name) for DMA_CH94_SDCRCR.
* To use register names with standard convension, please use DMA_CH94_SDCRCR.
*/
#define DMA_SDCRCR094 (DMA_CH94_SDCRCR)

/** \brief 2BC8, DMARAM Channel 94 Source Address Register */
#define DMA_CH94_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012BC8u)
/** Alias (User Manual Name) for DMA_CH94_SADR.
* To use register names with standard convension, please use DMA_CH94_SADR.
*/
#define DMA_SADR094 (DMA_CH94_SADR)

/** \brief 2BCC, DMARAM Channel 94 Destination Address Register */
#define DMA_CH94_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012BCCu)
/** Alias (User Manual Name) for DMA_CH94_DADR.
* To use register names with standard convension, please use DMA_CH94_DADR.
*/
#define DMA_DADR094 (DMA_CH94_DADR)

/** \brief 2BD0, DMARAM Channel 94 Address and Interrupt Control Register */
#define DMA_CH94_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012BD0u)
/** Alias (User Manual Name) for DMA_CH94_ADICR.
* To use register names with standard convension, please use DMA_CH94_ADICR.
*/
#define DMA_ADICR094 (DMA_CH94_ADICR)

/** \brief 2BD4, DMARAM Channel 94 Configuration Register */
#define DMA_CH94_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012BD4u)
/** Alias (User Manual Name) for DMA_CH94_CHCFGR.
* To use register names with standard convension, please use DMA_CH94_CHCFGR.
*/
#define DMA_CHCFGR094 (DMA_CH94_CHCFGR)

/** \brief 2BD8, DMARAM Channel 94 Shadow Address Register */
#define DMA_CH94_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012BD8u)
/** Alias (User Manual Name) for DMA_CH94_SHADR.
* To use register names with standard convension, please use DMA_CH94_SHADR.
*/
#define DMA_SHADR094 (DMA_CH94_SHADR)

