feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC37A/_Reg/IfxDma_reg.h
/** \brief 2E8C, DMARAM Channel 116 Destination Address Register */
#define DMA_CH116_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012E8Cu)
/** Alias (User Manual Name) for DMA_CH116_DADR.
* To use register names with standard convension, please use DMA_CH116_DADR.
*/
#define DMA_DADR116 (DMA_CH116_DADR)

/** \brief 2E90, DMARAM Channel 116 Address and Interrupt Control Register */
#define DMA_CH116_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012E90u)
/** Alias (User Manual Name) for DMA_CH116_ADICR.
* To use register names with standard convension, please use DMA_CH116_ADICR.
*/
#define DMA_ADICR116 (DMA_CH116_ADICR)

/** \brief 2E94, DMARAM Channel 116 Configuration Register */
#define DMA_CH116_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012E94u)
/** Alias (User Manual Name) for DMA_CH116_CHCFGR.
* To use register names with standard convension, please use DMA_CH116_CHCFGR.
*/
#define DMA_CHCFGR116 (DMA_CH116_CHCFGR)

/** \brief 2E98, DMARAM Channel 116 Shadow Address Register */
#define DMA_CH116_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012E98u)
/** Alias (User Manual Name) for DMA_CH116_SHADR.
* To use register names with standard convension, please use DMA_CH116_SHADR.
*/
#define DMA_SHADR116 (DMA_CH116_SHADR)

/** \brief 2E9C, DMARAM Channel 116 Control and Status Register */
#define DMA_CH116_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012E9Cu)
/** Alias (User Manual Name) for DMA_CH116_CHCSR.
* To use register names with standard convension, please use DMA_CH116_CHCSR.
*/
#define DMA_CHCSR116 (DMA_CH116_CHCSR)

/** \brief 2EA0, DMARAM Channel 117 Read Data CRC Register */
#define DMA_CH117_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012EA0u)
/** Alias (User Manual Name) for DMA_CH117_RDCRCR.
* To use register names with standard convension, please use DMA_CH117_RDCRCR.
*/
#define DMA_RDCRCR117 (DMA_CH117_RDCRCR)

/** \brief 2EA4, DMARAM Channel 117 Source and Destination Address CRC Register */
#define DMA_CH117_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012EA4u)
/** Alias (User Manual Name) for DMA_CH117_SDCRCR.
* To use register names with standard convension, please use DMA_CH117_SDCRCR.
*/
#define DMA_SDCRCR117 (DMA_CH117_SDCRCR)

/** \brief 2EA8, DMARAM Channel 117 Source Address Register */
#define DMA_CH117_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012EA8u)
/** Alias (User Manual Name) for DMA_CH117_SADR.
* To use register names with standard convension, please use DMA_CH117_SADR.
*/
#define DMA_SADR117 (DMA_CH117_SADR)

/** \brief 2EAC, DMARAM Channel 117 Destination Address Register */
#define DMA_CH117_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012EACu)
/** Alias (User Manual Name) for DMA_CH117_DADR.
* To use register names with standard convension, please use DMA_CH117_DADR.
*/
#define DMA_DADR117 (DMA_CH117_DADR)

/** \brief 2EB0, DMARAM Channel 117 Address and Interrupt Control Register */
#define DMA_CH117_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012EB0u)
/** Alias (User Manual Name) for DMA_CH117_ADICR.
* To use register names with standard convension, please use DMA_CH117_ADICR.
*/
#define DMA_ADICR117 (DMA_CH117_ADICR)

/** \brief 2EB4, DMARAM Channel 117 Configuration Register */
#define DMA_CH117_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012EB4u)
/** Alias (User Manual Name) for DMA_CH117_CHCFGR.
* To use register names with standard convension, please use DMA_CH117_CHCFGR.
*/
#define DMA_CHCFGR117 (DMA_CH117_CHCFGR)

/** \brief 2EB8, DMARAM Channel 117 Shadow Address Register */
#define DMA_CH117_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012EB8u)
/** Alias (User Manual Name) for DMA_CH117_SHADR.
* To use register names with standard convension, please use DMA_CH117_SHADR.
*/
#define DMA_SHADR117 (DMA_CH117_SHADR)

/** \brief 2EBC, DMARAM Channel 117 Control and Status Register */
#define DMA_CH117_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012EBCu)
/** Alias (User Manual Name) for DMA_CH117_CHCSR.
* To use register names with standard convension, please use DMA_CH117_CHCSR.
*/
#define DMA_CHCSR117 (DMA_CH117_CHCSR)

/** \brief 2EC0, DMARAM Channel 118 Read Data CRC Register */
#define DMA_CH118_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012EC0u)
/** Alias (User Manual Name) for DMA_CH118_RDCRCR.
* To use register names with standard convension, please use DMA_CH118_RDCRCR.
*/
#define DMA_RDCRCR118 (DMA_CH118_RDCRCR)

/** \brief 2EC4, DMARAM Channel 118 Source and Destination Address CRC Register */
#define DMA_CH118_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012EC4u)
/** Alias (User Manual Name) for DMA_CH118_SDCRCR.
* To use register names with standard convension, please use DMA_CH118_SDCRCR.
*/
#define DMA_SDCRCR118 (DMA_CH118_SDCRCR)

/** \brief 2EC8, DMARAM Channel 118 Source Address Register */
#define DMA_CH118_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012EC8u)
/** Alias (User Manual Name) for DMA_CH118_SADR.
* To use register names with standard convension, please use DMA_CH118_SADR.
*/
#define DMA_SADR118 (DMA_CH118_SADR)

/** \brief 2ECC, DMARAM Channel 118 Destination Address Register */
#define DMA_CH118_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012ECCu)
/** Alias (User Manual Name) for DMA_CH118_DADR.
* To use register names with standard convension, please use DMA_CH118_DADR.
*/
#define DMA_DADR118 (DMA_CH118_DADR)

/** \brief 2ED0, DMARAM Channel 118 Address and Interrupt Control Register */
#define DMA_CH118_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012ED0u)
/** Alias (User Manual Name) for DMA_CH118_ADICR.
* To use register names with standard convension, please use DMA_CH118_ADICR.
*/
#define DMA_ADICR118 (DMA_CH118_ADICR)

/** \brief 2ED4, DMARAM Channel 118 Configuration Register */
#define DMA_CH118_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012ED4u)
/** Alias (User Manual Name) for DMA_CH118_CHCFGR.
* To use register names with standard convension, please use DMA_CH118_CHCFGR.
*/
#define DMA_CHCFGR118 (DMA_CH118_CHCFGR)

/** \brief 2ED8, DMARAM Channel 118 Shadow Address Register */
#define DMA_CH118_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012ED8u)
/** Alias (User Manual Name) for DMA_CH118_SHADR.
* To use register names with standard convension, please use DMA_CH118_SHADR.
*/
#define DMA_SHADR118 (DMA_CH118_SHADR)

/** \brief 2EDC, DMARAM Channel 118 Control and Status Register */
#define DMA_CH118_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012EDCu)
/** Alias (User Manual Name) for DMA_CH118_CHCSR.
* To use register names with standard convension, please use DMA_CH118_CHCSR.
*/
#define DMA_CHCSR118 (DMA_CH118_CHCSR)

/** \brief 2EE0, DMARAM Channel 119 Read Data CRC Register */
#define DMA_CH119_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012EE0u)
/** Alias (User Manual Name) for DMA_CH119_RDCRCR.
* To use register names with standard convension, please use DMA_CH119_RDCRCR.
*/
#define DMA_RDCRCR119 (DMA_CH119_RDCRCR)

/** \brief 2EE4, DMARAM Channel 119 Source and Destination Address CRC Register */
#define DMA_CH119_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012EE4u)
/** Alias (User Manual Name) for DMA_CH119_SDCRCR.
* To use register names with standard convension, please use DMA_CH119_SDCRCR.
*/
#define DMA_SDCRCR119 (DMA_CH119_SDCRCR)

/** \brief 2EE8, DMARAM Channel 119 Source Address Register */
#define DMA_CH119_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012EE8u)
/** Alias (User Manual Name) for DMA_CH119_SADR.
* To use register names with standard convension, please use DMA_CH119_SADR.
*/
#define DMA_SADR119 (DMA_CH119_SADR)

/** \brief 2EEC, DMARAM Channel 119 Destination Address Register */
#define DMA_CH119_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012EECu)
/** Alias (User Manual Name) for DMA_CH119_DADR.
* To use register names with standard convension, please use DMA_CH119_DADR.
*/
#define DMA_DADR119 (DMA_CH119_DADR)

